### **Data Wrangling and Analysis**

In [49]:
# importing the dataset
import pandas as pd

data = pd.read_csv('/Users/beatrizgil/Documents/Prog.DC/Project_PDC/nova_ims_teaching_staff_2024-11-21.csv')

data.head()

,Name,Title,Courses,Publications,Biography
0,Afonso Malheiro,Adjunct Lecturer,Web Analytics,0,Bachelor's degree in Management (Catholic Univ...
1,Afshin Ashofteh,Invited Assistant Professor,"Banking and Insurance Economics, Credit Risk S...",21,Afshin Ashofteh is a full-time University Prof...
2,Alexandra Variz,Adjunct Lecturer,Digital Marketing & E-Commerce,0,"Currently, I am working as a Digital Marketing..."
3,Alexandre Guilherme Marques,Adjunct Lecturer,Deep Learning,0,Alexandre Marques is an assistant professor at...
4,Alexandre Neto,Adjunct Lecturer,Group Project Seminar on Programming and Analysis,0,Bachelor's degree in Geographical Engineering ...

In [51]:
# identifying overall data integrity
# there are 5 biographies missing
# there is a total of 230 observations
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 230 entries, 0 to 229
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          230 non-null    object
 1   Title         230 non-null    object
 2   Courses       230 non-null    object
 3   Publications  230 non-null    int64
 4   Biography     225 non-null    object
dtypes: int64(1), object(4)
memory usage: 9.1+ KB

In [53]:
# quick overview of the numerical variables (publications)
data.describe()

       Publications
count    230.000000
mean      10.352174
std       30.695893
min        0.000000
25%        0.000000
50%        0.000000
75%        5.000000
max      218.000000

In [55]:
# quick overview of the categorical and text columns (name, title, courses and biography)
data.describe(include = 'O')

,Name,Title,Courses,Biography
count,230,230,230,225
unique,230,10,190,206
top,Afonso Malheiro,Adjunct Lecturer,"Research Methodologies, Research Methods, Rese...",Information available soon.
freq,1,115,7,20

In [57]:
bios_data = pd.DataFrame(data['Biography'].value_counts()).reset_index()
bios_data.columns = ['Biography', 'Count']

dupl_bios = bios_data.query('Count > 1')
dupl_bios.head()

# there are 20 biographies which say 'Information available soon', which we decided not to change
# there are still missing values in the biography column which we are treating next

                     Biography  Count
0  Information available soon.     20

### 1.Treat missing values and duplicates, justify your approach

In [60]:
# checking if there are any duplicate observations in the dataframe
# there are no duplicates since the returned dataframe of duplicate names is empty
names_data = pd.DataFrame(data['Name'].value_counts()).reset_index()
names_data.columns = ['Name', 'Count']

dupl_names = names_data.query('Count > 1')
dupl_names.head()

Empty DataFrame
Columns: [Name, Count]
Index: []

In [62]:
# filling the missing values (which only exist in the Biography column) with the string 'Nan'
data['Biography'] = data['Biography'].fillna('Nan')

### 2.a) Which teachers have the highest wordcount* (top 1, name only)?

In [73]:
# Calculate word count for each biography
data['word_count'] = data['Biography'].str.split().str.len()

# Sum word counts per teacher
word_counts = data.groupby("Name")["word_count"].sum()

# Sort the values in descending order and extract the top teacher(name only)
top_wordcount_teacher = word_counts.sort_values(ascending=False).index[0]

print("The teacher with the highest word count:", top_wordcount_teacher)

The teacher with the highest word count: Miguel de Castro Neto

### 2.b) highest coursecount* (top 5) ?

In [87]:
# Calculate course count for each teacher
data['course_count'] = data['Courses'].str.split(',').str.len()

# Sort data by course count in descending order
cc_sorted = data.sort_values(by='course_count', ascending=False)

# Get the 5 teachers' names with the highest course counts
top_teachers = cc_sorted.iloc[0:5][['Name','course_count']]

print("The top 5 teachers with the highest coursecount are:\n", top_5_coursecount)

The top 5 teachers with the highest coursecount are:
 Name
Guilherme Victorino    43
Joana Neves            38
Pedro Simões Coelho    37
Ian Scott              37
Vítor Santos           31
Name: course_count, dtype: int64

### 2.c) most publications (top 10) ?

In [41]:
publication_counts = data.groupby("Name")["Publications"].sum()

# Sort values in descending order and extract the top 10 teachers
top_10_most_pub = publication_counts.sort_values(ascending=False).head(10)

print("The 10 publications with highest count are \n", top_10_most_pub)

The 10 publications with highest count are
 Name
Tiago Oliveira           218
Mauro Castelli           213
Leonardo Vanneschi       198
Marco Painho             131
Miguel de Castro Neto    116
Vítor Santos             109
Fernando Bação            92
Jorge Bravo               89
Diego Costa Pinto         78
Mário Caetano             76
Name: Publications, dtype: int64

### 3.a) How are the wordcount, coursecount and publications distributed and related?

### 3.b) Are there differences in those variables for different types of teachers

### 4.a) How many different courses (unique course names) are taught at NOVA IMS?

### 4.b) How many courses (unique course names) are taught by only one teacher?

### 4.c) What's the probability of someone teaching 'Data Mining I' also teaching ‘Data Mining II'?